{
    "Spells": [
        {
            "name": "cure-wounds",
            "2": "Evocation",
            "3": "Level:",
            "4": "1",
            "5": "Casting time:",
            "6": "1 Action",
            "7": "Range:",
            "8": "Touch",
            "9": "Components:",
            "10": "V, S",
            "11": "Duration:",
            "12": "Instantaneous",
            "13": "A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs.",
            "14": "At higher level",
            "15": "When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d8 for each slot level above 1st.",
            "16": "Page: 230  Players Handbook"
        },
        {
            "name": "healing-word",
            "2": "Evocation",
            "3": "Level:",
            "4": "1",
            "5": "Casting time:",
            "6": "1 Bonus Action",
            "7": "Range:",
            "8": "60 feet",
            "9": "Components:",
            "10": "V",
            "11": "Duration:",
            "12": "Instantaneous",
            "13": "A creature of your choice that you can see within range regains hit points equal to 1d4 + your spellcasting ability modifier.",
            "14": "This spell has no effect on undead or constructs.",
            "15": "At higher level",
            "16": "When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d4 for each slot level above 1st.",
            "17": "Page: 250  Players Handbook"
        },
        {
            "name": "fireball",
            "2": "Evocation",
            "3": "Level:",
            "4": "3",
            "5": "Casting time:",
            "6": "1 Action",
            "7": "Range:",
            "8": "150 feet",
            "9": "Components:",
            "10": "V, S, M (a tiny ball of bat guano and sulfur)",
            "11": "Duration:",
            "12": "Instantaneous",
            "13": "A bright streak flashes from your pointing finger to a point you choose within range then blossoms with a low roar into an explosion of flame.",
            "14": "Each creature in a 20-foot radius must make a Dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one. The fire spreads around corners. It ignites flammable objects in the area that aren’t being worn or carried.",
            "15": "At higher level",
            "16": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.",
            "17": "Page: 241  Players Handbook"
        },
        {
            "name": "hex",
            "2": "Enchantment",
            "3": "Level:",
            "4": "1",
            "5": "Casting time:",
            "6": "1 Bonus Action",
            "7": "Range:",
            "8": "90 feet",
            "9": "Components:",
            "10": "V, S, M (the petrified eye of a newt)",
            "11": "Duration:",
            "12": "Concentration, up to 1 hour",
            "13": "You place a curse on a creature that you can see within range. Until the spell ends, you deal an extra 1d6 necrotic damage to the target whenever you hit it with an attack. Also, choose one ability when you cast the spell. The target has disadvantage on ability checks made with the chosen ability.",
            "14": "If the target drops to 0 hit points before this spell ends, you can use a bonus action on a subsequent turn of yours to curse a new creature.",
            "15": "A remove curse cast on the target ends this spell early.",
            "16": "At higher level",
            "17": "When you cast this spell using a spell slot of 3rd or 4th level, you can maintain your concentration on the spell for up to 8 hours.",
            "18": "When you use a spell slot of 5th level or higher, you can maintain your concentration on the spell for up to 24 hours.",
            "19": "Page: 251  Players Handbook"
        },
        {
            "name": "leomunds-tiny-hut",
            "2": "Evocation",
            "3": "Level:",
            "4": "3",
            "5": "Casting time:",
            "6": "1 Minute",
            "7": "Range:",
            "8": "Self (10-foot-radius hemisphere)",
            "9": "Components:",
            "10": "V, S, M (a small crystal bead)",
            "11": "Duration:",
            "12": "8 hours",
            "13": "A 10-foot-radius immobile dome of force springs into existence around and above you and remains stationary for the duration. The spell ends if you leave its area.",
            "14": "Nine creatures of Medium size or smaller can fit inside the dome with you. The spell fails if its area includes a larger creature or more than nine creatures. Creatures and objects within the dome when you cast this spell can move through it freely. All other creatures and objects are barred from passing through it. Spells and other magical effects can’t extend through the dome or be cast through it. The atmosphere inside the space is comfortable and dry, regardless of the weather outside.",
            "15": "Until the spell ends, you can command the interior to become dimly lit or dark. The dome is opaque from the outside, of any color you choose, but it is transparent from the inside.",
            "16": "Page: 255  Players Handbook"
        },
        {
            "name": "charm-person",
            "2": "Enchantment",
            "3": "Level:",
            "4": "1",
            "5": "Casting time:",
            "6": "1 Action",
            "7": "Range:",
            "8": "30 feet",
            "9": "Components:",
            "10": "V, S",
            "11": "Duration:",
            "12": "1 hour",
            "13": "You attempt to charm a humanoid you can see within range.",
            "14": "It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you  or your companions do anything harmful to it.The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you.",
            "15": "At higher level",
            "16": "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.",
            "17": "Page: 221  Players Handbook"
        },
        {
            "name": "pass-without-trace",
            "2": "Abjuration",
            "3": "Level:",
            "4": "2",
            "5": "Casting time:",
            "6": "1 Action",
            "7": "Range:",
            "8": "Self",
            "9": "Components:",
            "10": "V, S, M (ashes from a burned leaf of mistletoe and a sprig of spruce)",
            "11": "Duration:",
            "12": "Concentration, up to 1 hour",
            "13": "A veil of shadows and silence radiates from you, masking you and your companions from detection.",
            "14": "For the duration, each creature you choose within 30 feet of you (including you) has a +10 bonus to Dexterity (Stealth) checks and can’t be tracked except by magical means. A creature that receives this bonus leaves behind no tracks or other traces of its passage.",
            "15": "Page: 264  Players Handbook"
        },
        {
            "name": "goodberry",
            "2": "Transmutation",
            "3": "Level:",
            "4": "1",
            "5": "Casting time:",
            "6": "1 Action",
            "7": "Range:",
            "8": "Touch",
            "9": "Components:",
            "10": "V, S, M (a sprig of mistletoe)",
            "11": "Duration:",
            "12": "Instantaneous",
            "13": "Up to ten berries appear in your hand and are infused with magic for the duration. A creature can use its action to eat one berry. Eating a berry restores 1 hit point, and the berry provides enough nourishment to sustain a creature for one day.",
            "14": "The berries lose their potency if they have not been consumed within 24 hours of the casting of this spell.",
            "15": "Page: 246  Players Handbook"
        },
        {
            "name": "hold-person",
            "2": "Enchantment",
            "3": "Level:",
            "4": "2",
            "5": "Casting time:",
            "6": "1 Action",
            "7": "Range:",
            "8": "60 feet",
            "9": "Components:",
            "10": "V, S, M (a small, straight piece of iron)",
            "11": "Duration:",
            "12": "Concentration, up to 1 minute",
            "13": "Choose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target.",
            "14": "At higher level",
            "15": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional humanoid for each slot level above 2nd. The humanoids must be within 30 feet of each other when you target them.",
            "16": "Page: 251  Players Handbook"
        },
        {
            "name": "hunters-mark",
            "2": "Divination",
            "3": "Level:",
            "4": "1",
            "5": "Casting time:",
            "6": "1 Bonus Action",
            "7": "Range:",
            "8": "90 feet",
            "9": "Components:",
            "10": "V",
            "11": "Duration:",
            "12": "Concentration, up to 1 hour",
            "13": "You choose a creature you can see within range and mystically mark it as your quarry.",
            "14": "Until the spell ends, you deal an extra 1d6 damage to the target whenever you hit it with a weapon attack, and you have advantage on any Wisdom (Perception) or Wisdom (Survival) check you make to find it. If the target drops to 0 hit points before this spell ends, you can use a bonus action on a subsequent turn of yours to mark a new creature.",
            "15": "At higher level",
            "16": "When you cast this spell using a spell slot of 3rd or 4th level, you can maintain your concentration on the spell for up to 8 hours.",
            "17": "When you use a spell slot of 5th level or higher, you can maintain your concentration on the spell for up to 24 hours.",
            "18": "Page: 251  Players Handbook"
        },
        {
            "name": "gust",
            "2": "A Elemental Evil spell",
            "3": "Transmutation",
            "4": "Level:",
            "5": "Cantrip",
            "6": "Casting time:",
            "7": "1 Action",
            "8": "Range:",
            "9": "30 feet",
            "10": "Components:",
            "11": "V, S",
            "12": "Duration:",
            "13": "Instantaneous",
            "14": "You seize the air and compel it to create one of the following effects at a point you can see within range:",
            "15": "• One Medium or smaller creature that you choose must succeed on a Strength saving throw or be pushed up to 5 feet away from you.",
            "16": "• You create a small blast of air capable of moving one object that is neither held nor carried and that weighs no more than 5 pounds. The object is pushed up to 10 feet away from you. It isn’t pushed with enough force to cause damage.",
            "17": "• You create a harmless sensory affect using air, such as causing leaves to rustle, wind to slam shutters shut, or your clothing to ripple in a breeze.",
            "18": "Page: 19  from EE Players Companion"
        },
        {
            "name": "sleep",
            "2": "Enchantment",
            "3": "Level:",
            "4": "1",
            "5": "Casting time:",
            "6": "1 Action",
            "7": "Range:",
            "8": "90 feet",
            "9": "Components:",
            "10": "V, S, M (a pinch of fine sand, rose petals, or a cricket)",
            "11": "Duration:",
            "12": "1 minute",
            "13": "This spell sends creatures into a magical slumber. Roll 5d8, the total is how many hit points of creatures this spell can affect. Creatures within 20 feet of a point you choose within range are affected in ascending order of their current hit points (ignoring unconscious creatures).",
            "14": "Starting with the creature that has the lowest current hit points, each creature affected by this spell falls unconscious until the spell ends, the sleeper takes damage, or someone uses an action to shake or slap the sleeper awake. Subtract each creature’s hit points from the total before moving on to the creature with the next lowest hit points. A creature’s hit points must be equal to or less than the remaining total for that creature to be affected.",
            "15": "Undead and creatures immune to being charmed aren’t affected by this spell.",
            "16": "At higher level",
            "17": "When you cast this spell using a spell slot of 2nd level or higher, roll an additional 2d8 for each slot level above 1st.",
            "18": "Page: 276  Players Handbook"
        },
        {
            "name": "mage-hand",
            "2": "Conjuration",
            "3": "Level:",
            "4": "Cantrip",
            "5": "Casting time:",
            "6": "1 Action",
            "7": "Range:",
            "8": "30 feet",
            "9": "Components:",
            "10": "V, S",
            "11": "Duration:",
            "12": "1 minute",
            "13": "A spectral, floating hand appears at a point you choose within range.",
            "14": "The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again.",
            "15": "You can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 30 feet each time you use it.",
            "16": "The hand can’t attack, activate magical items, or carry more than 10 pounds.",
            "17": "Page: 256  Players Handbook"
        },
        {
            "name": "guidance",
            "2": "Divination",
            "3": "Level:",
            "4": "Cantrip",
            "5": "Casting time:",
            "6": "1 Action",
            "7": "Range:",
            "8": "Touch",
            "9": "Components:",
            "10": "V, S",
            "11": "Duration:",
            "12": "Concentration, up to 1 minute",
            "13": "You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one ability check of its choice. It can roll the die before or after making the ability check. The spell then ends.",
            "14": "Page: 248  Players Handbook"
        },
        {
            "name": "fire-bolt",
            "2": "Evocation",
            "3": "Level:",
            "4": "Cantrip",
            "5": "Casting time:",
            "6": "1 Action",
            "7": "Range:",
            "8": "120 feet",
            "9": "Components:",
            "10": "V, S",
            "11": "Duration:",
            "12": "Instantaneous",
            "13": "You hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isn’t being worn or carried.",
            "14": "At higher level",
            "15": "This spell’s damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).",
            "16": "Page: 241  Players Handbook"
        },
        {
            "name": "flaming-sphere",
            "2": "Conjuration",
            "3": "Level:",
            "4": "2",
            "5": "Casting time:",
            "6": "1 Action",
            "7": "Range:",
            "8": "60 feet",
            "9": "Components:",
            "10": "V, S, M (a bit of tallow, a pinch of brimstone, and a dusting of powdered iron)",
            "11": "Duration:",
            "12": "Concentration, up to 1 minute",
            "13": "A 5-foot-diameter sphere of fire appears in an unoccupied space of your choice within range and lasts for the duration.",
            "14": "Any creature that ends its turn within 5 feet of the sphere must make a Dexterity saving throw. The creature takes 2d6 fire damage on a failed save, or half as much damage on a successful one.",
            "15": "As a bonus action, you can move the sphere up to 30 feet. If you ram the sphere into a creature, that creature must make the saving throw against the sphere’s damage, and the sphere stops moving this turn.",
            "16": "When you move the sphere, you can direct it over barriers up to 5 feet tall and jump it across pits up to 10 feet wide. The sphere ignites flammable objects not being worn or carried, and it sheds bright light in a 20-foot radius and dim light for an additional 20 feet.",
            "17": "At higher level",
            "18": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd.",
            "19": "Page: 242  Players Handbook"
        },
        {
            "name": "entangle",
            "2": "Conjuration",
            "3": "Level:",
            "4": "1",
            "5": "Casting time:",
            "6": "1 Action",
            "7": "Range:",
            "8": "90 feet",
            "9": "Components:",
            "10": "V, S",
            "11": "Duration:",
            "12": "Concentration, up to 1 minute",
            "13": "Grasping weeds and vines sprout from the ground in a 20-foot square starting from a point within range. For the duration, these plants turn the ground in the area into difficult terrain.",
            "14": "A creature in the area when you cast the spell must succeed on a Strength saving throw or be restrained by the entangling plants until the spell ends. A creature restrained by the plants can use its action to make a Strength check against your spell save DC. On a success, it frees itself.",
            "15": "When the spell ends, the conjured plants wilt away.",
            "16": "Page: 238  Players Handbook"
        },
        {
            "name": "flame-blade",
            "2": "Evocation",
            "3": "Level:",
            "4": "2",
            "5": "Casting time:",
            "6": "1 Bonus Action",
            "7": "Range:",
            "8": "Self",
            "9": "Components:",
            "10": "V, S, M (leaf of sumac)",
            "11": "Duration:",
            "12": "Concentration, up to 10 minutes",
            "13": "You evoke a fiery blade in your free hand.",
            "14": "The blade is similar in size and shape to a scimitar, and it lasts for the duration. If you let go of the blade, it disappears, but you can evoke the blade again as a bonus action.",
            "15": "You can use your action to make a melee spell attack with the fiery blade. On a hit, the target takes 3d6 fire damage.",
            "16": "The flaming blade sheds bright light in a 10-foot radius and dim light for an additional 10 feet.",
            "17": "At higher level",
            "18": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for every two slot levels above 2nd.",
            "19": "Page: 242  Players Handbook"
        },
        {
            "name": "shillelagh",
            "2": "Transmutation",
            "3": "Level:",
            "4": "Cantrip",
            "5": "Casting time:",
            "6": "1 Bonus Action",
            "7": "Range:",
            "8": "Touch",
            "9": "Components:",
            "10": "V, S, M (mistletoe, a shamrock leaf, and a club or quarterstaff)",
            "11": "Duration:",
            "12": "1 minute",
            "13": "The wood of a club or quarterstaff you are holding is imbued with nature’s power.",
            "14": "For the duration, you can use your spellcasting ability instead of Strength for the attack and damage rolls of melee attacks using that weapon, and the weapon’s damage die becomes a d8. The weapon also becomes magical, if it isn’t already. The spell ends if you cast it again or if you let go of the weapon",
            "15": "Page: 275  Players Handbook"
        },
        {
            "name": "armor-of-agathys",
            "2": "Abjuration",
            "3": "Level:",
            "4": "1",
            "5": "Casting time:",
            "6": "1 Action",
            "7": "Range:",
            "8": "Self",
            "9": "Components:",
            "10": "V, S, M (a cup of water)",
            "11": "Duration:",
            "12": "1 hour",
            "13": "A protective magical force surrounds you, manifesting as a spectral frost that covers you and your gear.",
            "14": "You gain 5 temporary hit points for the duration. If a creature hits you with a melee attack while you have these hit points, the creature takes 5 cold damage.",
            "15": "At higher level",
            "16": "When you cast this spell using a spell slot of 2nd level or higher, both the temporary hit points and the cold damage increase by 5 for each slot",
            "17": "Page: 215  Players Handbook"
        },
        {
            "name": "misty-step",
            "2": "Conjuration",
            "3": "Level:",
            "4": "2",
            "5": "Casting time:",
            "6": "1 Bonus Action",
            "7": "Range:",
            "8": "Self",
            "9": "Components:",
            "10": "V",
            "11": "Duration:",
            "12": "Instantaneous",
            "13": "Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space that you can see.",
            "14": "Page: 260  Players Handbook"
        },
        {
            "name": "wall-of-fire",
            "2": "Evocation",
            "3": "Level:",
            "4": "4",
            "5": "Casting time:",
            "6": "1 Action",
            "7": "Range:",
            "8": "120 feet",
            "9": "Components:",
            "10": "V, S, M (a small piece of phosphorus)",
            "11": "Duration:",
            "12": "Concentration, up to 1 minute",
            "13": "You create a wall of fire on a solid surface within range. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for the duration.",
            "14": "When the wall appears, each creature within its area must make a Dexterity saving throw. On a failed save, a creature takes 5d8 fire damage, or half as much damage on a successful save.",
            "15": "One side of the wall, selected by you when you cast this spell, deals 5d8 fire damage to each creature that ends its turn within 10 feet of that side or inside the wall. A creature takes the same damage when it enters the wall for the first time on a turn or ends its turn there. The other side of the wall deals no damage.",
            "17": "When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d8 for each slot level above 4th.",
            "18": "Page: 285  Players Handbook"
        },
        {
            "name": "snare",
            "2": "A spell from  Xanathar's Guide To Everything",
            "3": "Abjuration",
            "4": "Level:",
            "5": "1",
            "6": "Casting time:",
            "7": "1 Minute",
            "8": "Range:",
            "9": "Touch",
            "10": "Components:",
            "11": "S, M (25 feet of rope, which the spell consumes)",
            "12": "Duration:",
            "13": "8 hours",
            "14": "As you cast this spell, you use the rope to create a circle with a 5-foot radius on the ground or the floor. When you finish casting, the rope disappears and the circle becomes a magic trap.",
            "15": "This trap is nearly invisible, requiring a successful Intelligence (Investigation) check against your spell save DC to be discerned.",
            "16": "The trap triggers when a Small, Medium, or Large creature moves onto the ground or the floor in the spell’s radius. That creature must succeed on a Dexterity saving throw or be magically hoisted into the air, leaving it hanging upside down 3 feet above the ground or the floor. The creature is restrained there until the spell ends.",
            "17": "A restrained creature can make a Dexterity saving throw at the end of each of its turns, ending the effect on itself on a success. Alternatively, the creature or someone else who can reach it can use an action to make an Intelligence (Arcana) check against your spell save DC. On a success, the restrained effect ends.",
            "18": "After the trap is triggered, the spell ends when no creature is restrained by it.",
            "19": "Page: 165  from Xanathar's Guide To Everything"
        },
        {
            "name": "ice-knife",
            "2": "A Elemental Evil spell",
            "3": "Conjuration",
            "4": "Level:",
            "5": "1",
            "6": "Casting time:",
            "7": "1 Action",
            "8": "Range:",
            "9": "60 feet",
            "10": "Components:",
            "11": "S, M",
            "12": "Duration:",
            "13": "Instantaneous",
            "14": "(a drop of water or piece of ice)",
            "15": "You create a shard of ice and fling it at one creature within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 piercing damage. Hit or miss, the shard then explodes. The target and each creature within 5 feet of the point where the ice exploded must succeed on a Dexterity saving throw or take 2d6 cold damage.",
            "16": "At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the cold damage increases by 1d6 for each slot level above 1st.",
            "17": "Page: 19  from EE Players Companion"
        }
    ]
}